docs/phases/uap-warmups-alternative-general-warm-up.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Alternative General Warm-up</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../static/common.css" />
<link rel="stylesheet" type="text/css" href="../static/workout.css" />
<link rel="icon" type="image/ico" href="../static/dumbell.ico" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="uap-warmups.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Alternative General Warm-up
<br />
<span class="subtitle">uap-warmups</span>
</h1>
<p>
There is no one perfect warm up. How much of a warm up you need will depend on things like your age, the time of day, or how you're feeling on a particular day.  Below are some exercises you can do for a warm up to prepare for any of the lactic of alactic sessions.
</p>

<p>
In general, you just want to do progress from less intense movement to movement that is the same intensity of the workout you will be doing.  You'll see I start with mobility drills and move into sprint and multidirectional movement drills.  There are about a million options to choose from for warm-up drills.  Feel free to wander from what is presented below.
</p>

<div id="outline-container-org4ac1015" class="outline-2">
<h2 id="org4ac1015">Some Mobility First</h2>
<div class="outline-text-2" id="text-org4ac1015">
<p>
<b>(click each to display more info)</b>
</p>
</div>
</div>

<div id="outline-container-org907bc51" class="outline-2">
<h2 id="org907bc51">1. Five Point Lunge</h2>
</div>
<div id="outline-container-orgae12712" class="outline-2">
<h2 id="orgae12712">2. High Knee Hugs</h2>
</div>
<div id="outline-container-org90ba13d" class="outline-2">
<h2 id="org90ba13d">3. Walking Quad Stretch</h2>
</div>
<div id="outline-container-orgd74f5e5" class="outline-2">
<h2 id="orgd74f5e5">4. Three Point SLDL</h2>
<div class="outline-text-2" id="text-orgd74f5e5">
<p>
or combo of 3 and 4 in the Walking quad stretch plus SLDL
</p>
</div>
</div>

<div id="outline-container-org2b4af0f" class="outline-2">
<h2 id="org2b4af0f">Now warm up the body</h2>
</div>
<div id="outline-container-org4c905e1" class="outline-2">
<h2 id="org4c905e1">1. Power Skips</h2>
</div>
<div id="outline-container-org8fcb1fc" class="outline-2">
<h2 id="org8fcb1fc">2. High Knees</h2>
</div>
<div id="outline-container-org4b52efc" class="outline-2">
<h2 id="org4b52efc">3. Butt Kicks</h2>
</div>
<div id="outline-container-orgd1070fc" class="outline-2">
<h2 id="orgd1070fc">4. Cariocas</h2>
</div>
<div id="outline-container-org548f870" class="outline-2">
<h2 id="org548f870">5. Shuffles</h2>
</div>
<div id="outline-container-org1a5721a" class="outline-2">
<h2 id="org1a5721a">6. Leprechaun Skips</h2>
</div>
<div id="outline-container-org917bf3f" class="outline-2">
<h2 id="org917bf3f">7. Zombie Kicks</h2>
</div>
<div id="outline-container-org31141a4" class="outline-2">
<h2 id="org31141a4">8. Five step bursts</h2>
</div>
</div>
</body>
</html>
